[
    {
        "Type": "Expository",
        "Input": "Reporting loved ones for dangerous behavior involves a conflict between personal loyalty and public safety.",
        "Output": "Reporting a close-other to authorities can save lives from extreme deviant behaviors but it also poses a dilemma as gatekeepers struggle between their relationship and societal obligations."
    },
    {
        "Type": "Expository",
        "Input": "Focusing on the future boosts the intent to report by strengthening both social and relational duty.",
        "Output": "Notably, a future time perspective increased reporting intentions by elevating the motivational strength of all societal obligations (e.g., concern for innocent others) and one relationship obligation (helping the close-other)."
    },
    {
        "Type": "Expository",
        "Input": "Incidents of mass violence and extremism in the U.S. have recently hit record levels.",
        "Output": "Mass shootings and violent extremism in the United States have reached an all-time high in recent years."
    },
    {
        "Type": "Narrative",
        "Input": "An acquaintance of the Las Vegas shooter had suspected his violent intentions based on four years of interaction",
        "Output": "A friend of Steven Paddock, the perpetrator of the 2017 mass shooting in Las Vegas, had grown suspicious about Paddock’s plans to execute a mass shooting through their interactions over a period of 4 years."
    },
    {
        "Type": "Expository",
        "Input": "Gatekeepers experience conflict between their duties to close relations and their responsibilities to the public",
        "Output": "Gatekeepers’ dilemmas reflect the interplay between their obligations to loved ones and society."
    },
    {
        "Type": "Expository",
        "Input": "Meeting relational duties is essential for maintaining and preserving close personal bonds.",
        "Output": "Relationship obligations are inherent in close relationships and fulfilling them helps sustain personal ties."
    },
    {
        "Type": "Argumentative",
        "Input": "The proposed model suggests that motivational strength influences reporting choices both directly and through expected regret.",
        "Output": "Thus, our model posits that motivational strength predicts reporting decisions directly and indirectly via anticipated regret."
    },
    {
        "Type": "Expository",
        "Input": "A future-oriented mindset strengthens the desire to report by reinforcing both communal and specific interpersonal duties",
        "Output": "Notably, a future time perspective increased reporting intentions by elevating the motivational strength of all societal obligations (e.g., concern for innocent others) and one relationship obligation (helping the close-other)."
    },
    {
        "Type": "Expository",
        "Input": "The total of seven specific factors determines the cumulative motivation to withhold a report.",
        "Output": "The sum of these seven dimensions constitutes the overall motivational strength toward not reporting "
    },
    {
        "Type": "Argumentative",
        "Input": "Reporting a loved one involves a moral conflict between personal loyalty and the duty to protect society",
        "Output": "Reporting a close-other to authorities can save lives from extreme deviant behaviors but it also poses a dilemma as\\ngatekeepers struggle between their relationship and societal obligations."
    },
    {
        "Type": "Argumentative",
        "Input": "Human choice and proactive behavior have the potential to stop or mitigate human suffering",
        "Output": "The decisions and actions of human beings can prevent this kind of suffering"
    },
    {
        "Type": "Descriptive",
        "Input": "A lack of public action—including financial donations, political lobbying, and physical protests—to support refugee needs.",
        "Output": "Generally speaking, people have not given large sums to relief funds; they have not written to their parliamentary representatives demand ing increased government assistance; they have not demonstrated in the streets, held symbolic fasts, or done anything else directed toward providing the refugees with the means to satisfy their essential needs"
    },
    {
        "Type": "Expository",
        "Input": "Financial data showing Britain’s massive and rising expenditure on the Concorde project for economic comparison.",
        "Output": "For comparative purposes, Britain's share of the nonrecoverable development costs of the Anglo-French Concorde project is already in excess of 275,000,000 pounds, and on present estimates will reach 440,000,000 pounds"
    },
    {
        "Type": "Argumentative",
        "Input": "India faces a zero-sum trade-off between immediate refugee aid and long-term national development, where both choices result in loss of life.",
        "Output": "India will be forced to choose between letting the refugees starve or diverting funds from her own development program, which will mean that more of her own people will starve in the future"
    },
    {
        "Type": "Expository",
        "Input": "The crisis in Bengal is categorized as the most recent and severe instance in a global pattern of natural and human-caused disasters.",
        "Output": "The Bengal emergency is just the latest and most acute of a series of major emergencies in various parts of the world, arising both from natural and from man-made causes"
    },
    {
        "Type": "Casual",
        "Input": "An inquiry into the ethical consequences and rightness of actions within a complex or tragic scenario.",
        "Output": "What are the moral implications of a situation like this?"
    },
    {
        "Type": "Narrative",
        "Input": "An admission that the upcoming argument is intentionally biased and takes a specific ethical stance rather than an objective one.",
        "Output": "In arguing for this conclusion I will not, of course, claim to be morally neutral."
    },
    {
        "Type": "Expository",
        "Input": "A comparison showing that Australia's humanitarian aid is significantly smaller (less than 1/12th) than the expenditure on the Sydney Opera House",
        "Output": "Australia's aid, however, amounts to less than one twelfth of the cost of Sydney's new opera house"
    },
    {
        "Type": "Descriptive",
        "Input": "A situational report from November 1971 regarding the mortality rate in East Bengal caused by a lack of basic necessities",
        "Output": "As I write this, in November 1971, people are dying in East Bengal from lack of food, shelter, and medical care"
    },
    {
        "Type": "Argumentative",
        "Input": "While natural and political disasters have displaced millions, wealthy nations possess the resources necessary to significantly mitigate the resulting human suffering",
        "Output": "Constant poverty, a cyclone, and a civil war have turned at least nine million people into destitute refugees; nevertheless, it is not beyond the capacity of the richer nations to give enough assistance to reduce any further suffering to very small proportions."
    },
    {
        "Type": "Narrative",
        "Input": "A personal account of how a previous group project regarding Singapore's recycling rates sparked an interest in using behavioral change to solve social problems.",
        "Output": "My interest in tackling social issues via encouraging behavioural change began last year, when my group and I came up with a proposal on improving Singapore’s rate of recycling"
    },
    {
        "Type": "Argumentative",
        "Input": "Leveraging a data science background to contribute to the creation and validation of project hypotheses.",
        "Output": "My background in data science is a good fit for the project on hypothesis development and testing."
    },
    {
        "Type": "Narrative",
        "Input": "Previous collaboration with a psychology student provided exposure to behavioral concepts like gamification and social influence.",
        "Output": "Having worked with a psychology major, she introduced me to several phenomena surrounding public behaviour, such as the herd effect, gamification, and in-group competition."
    },
    {
        "Type": "Argumentative",
        "Input": "Proficiency in database systems aids in interpreting the technical architecture of data from wearables and apps.",
        "Output": "Furthermore, I believe that my knowledge from the module Database Systems (which is not in the scope of my major) would also give me an advantage in understanding the data structure in wearable devices and their accompanying mobile application"
    },
    {
        "Type": "Argumentative",
        "Input": "Proven skills in organization and communication provide the basis for managing documentation and stakeholder relations.",
        "Output": "This experience has equipped me with strong organisational and communication skills, so I am confident in my ability to update relevant documents and liaise with key stakeholders effectively."
    },
    {
        "Type": "Casual",
        "Input": "Expressing enthusiasm to join the team and gain knowledge on the intersection of data analytics and policy-making.",
        "Output": "I’m eager to bring my skills to your team and would love the opportunity to learn more about how data analytics is being applied in policy development."
    },
    {
        "Type": "Casual",
        "Input": "A formal expression of gratitude for the review of a submitted application.",
        "Output": "Thank you for considering my application."
    },
    {
        "Type": "Narrative",
        "Input": "Personal introduction identifying the speaker as a near-graduating Data Science & Analytics student at NUS",
        "Output": "My name is Tran, and I am a penultimate-year student at NUS, majoring in Data Science & Analytics."
    },
    {
        "Type": "Argumentative",
        "Input": "The internship is viewed as a unique opportunity to gain experience with big data and the full analytics life cycle.",
        "Output": "As the majority of my past projects have no iteration in this aspect, the internship would give me priceless insight into a data analytics life cycle, especially when working with big data."
    },
    {
        "Type": "Narrative",
        "Input": "Specific dates of availability spanning from mid-2025 through the beginning of 2026.",
        "Output": "I am available from 30 June (Monday) to 31 December 2025 (and the first few weeks of 2026 as well)"
    },
    {
        "Type": "Instructive",
        "Input": "The learning process focuses on hands-on experience and collaborative dialogue with peers and experts.",
        "Output": "You will mostly learn by doing, and through discussion with the instructors, guest lecturers, and your group members."
    },
    {
        "Type": "Instructive",
        "Input": "Encouragement to treat the environment as a low-risk professional simulation where experimentation is valued over perfection",
        "Output": "Remember, this is a simulation of a real-world data scientist role, where it’s safe to experiment and “fail”"
    },
    {
        "Type": "Expository",
        "Input": "Evaluation is based on the substance and insight of a student's input rather than just the frequency of participation.",
        "Output": "We will not just count the number of times students speak up or raise their hand, but also consider the quality of their contributions."
    },
    {
        "Type": "Expository",
        "Input": "Evaluation based on the demonstration of interpersonal skills, respect for peers, and proactive leadership",
        "Output": "The course instructor and TA will both observe whether students display active listening skills, are respectful of the ideas of others, and take a general leadership attitude."
    },
    {
        "Type": "Descriptive",
        "Input": "Student engagement will be monitored specifically through their activity on the Miro platform",
        "Output": "Since we will make heavy use of Miro, we will also track their participation on that platform."
    },
    {
        "Type": "Instructive",
        "Input": "Students with low engagement will receive a mid-course warning to allow time for improvement.",
        "Output": "If students fall behind in participation, we will give them feedback around the midterm, so they have an opportunity to catch up."
    },
    {
        "Type": "Instructive",
        "Input": "Assurance that consistent attendance, curiosity, and active involvement are the primary requirements for a high grade",
        "Output": "Do not overthink this: if you show up, participate, are curious, and are learning, you will get (near) full marks here."
    },
    {
        "Type": "Expository",
        "Input": "Academic credit or recognition is given for active listening and constructive collaboration with peers",
        "Output": "Students that listen to other students and build on others’ ideas will be rewarded."
    },
    {
        "Type": "Instructive",
        "Input": "The assessment process uses a combination of standardized Likert scale metrics and a comprehensive general review",
        "Output": "To introduce some structure, we will rate students on a Likert scale along a few metrics, on top of a holistic evaluation."
    },
    {
        "Type": "Expository",
        "Input": "Participation grades are determined by both the frequency of input and the substantive quality of that input",
        "Output": "Class participation will be assessed both quantitatively and qualitatively."
    },
    {
        "Type": "Narrative",
        "Input": "Personal hesitation to share feelings with parents due to fears of being misunderstood or failing to communicate effectively.",
        "Output": "I’m not open to my parents about how I feel or what’s going on with me because I fear that they won’t understand or that I won’t get my point across properly."
    },
    {
        "Type": "Narrative",
        "Input": "Seeking guidance while awaiting an initial appointment at a mental health facility.",
        "Output": "Not sure what to do as Im not currently in therapy, but I am waiting to be seen at amental health clinic"
    },
    {
        "Type": "Narrative",
        "Input": "Fluctuating ability to address a partner's volatile behavior based on sudden shifts in their demeanor.",
        "Output": "On good days I would attempt to talk about the escalation and unacceptable behaviors displayed. on bad days,however I could see the change in his eyes and snap everything would change"
    },
    {
        "Type": "Narrative",
        "Input": "A high school student self-identifying potential symptoms of anxiety.",
        "Output": "I’m a junior in high school, and I think I have anxiety."
    },
    {
        "Type": "Casual",
        "Input": "Inquiry regarding whether others experience internal physical shaking during periods of intense emotional distress.",
        "Output": "Does any body else get this weird inner tremor when theyre really badly triggered?"
    },
    {
        "Type": "Descriptive",
        "Input": "Physical manifestations of school-related stress, including nighttime dread and persistent daytime nausea",
        "Output": "I have this feeling of dread about school right before I go to bed and I wake up with an upset stomach which lasts all day and makes me feel like I’ll throw up."
    },
    {
        "Type": "Descriptive",
        "Input": "A recent increase in the frequency of distressing dreams.",
        "Output": "Also been having lots of nightmares again recently."
    },
    {
        "Type": "Casual",
        "Input": "An urgent appeal for support or direction due to feeling overwhelmed and isolated.",
        "Output": "I’m not sure where else to go with this, but I need help."
    },
    {
        "Type": "Narrative",
        "Input": "Past distress caused by a partner's invasive monitoring of the speaker's location and private movements.",
        "Output": "It use to frighten me he knew when I was on break if I spoke to someone or even what room I was at in my home"
    },
    {
        "Type": "Instructive",
        "Input": "A request for coping strategies from individuals who share similar experiences.",
        "Output": "If any of you have this, can you tell me how you deal with it?"
    }
]